Разработка_GZ/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Разработка_GZ/src/CommonModules/ПомощникЗаполнения3НДФЛКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПроверитьИННКПП(Форма, ПроверитьИНН, ПроверитьКПП) Экспорт
	
	ЭтоЮрЛицо = Форма.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
	
	Если ПроверитьИНН Тогда
		
		РезультатПроверки  = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(Форма.ИНН, ЭтоЮрЛицо);
		Форма.ОшибокПоИННнет     = НЕ ЗначениеЗаполнено(РезультатПроверки.ОписаниеОшибки);
		
		Форма.РезультатПроверкиИНН = Новый ФорматированнаяСтрока(РезультатПроверки.ОписаниеОшибки,, Форма.ЦветВыделенияНекорректногоЗначение);
		
		Форма.НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(Форма.РезультатПроверкиИНН);
		Форма.Элементы.НадписьПоясненияНекорректногоИНН.Видимость = НЕ ПустаяСтрока(Форма.РезультатПроверкиИНН);
		
	КонецЕсли;
	
	Если ПроверитьКПП Тогда
		
		РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямФорматаКПП(Форма.КПП, ЭтоЮрЛицо);
		Форма.ОшибокПоКППнет = РезультатПроверки.СоответствуетТребованиям;
		
		Форма.РезультатПроверкиКПП = Новый ФорматированнаяСтрока(РезультатПроверки.ОписаниеОшибки,, Форма.ЦветВыделенияНекорректногоЗначение);
		
		Форма.НадписьПоясненияНекорректногоКПП = Новый ФорматированнаяСтрока(Форма.РезультатПроверкиКПП);
		Форма.Элементы.НадписьПоясненияНекорректногоКПП.Видимость = НЕ ПустаяСтрока(Форма.РезультатПроверкиКПП);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьПолейКонтрагента(Форма, ОтображатьРеквизитыФизЛица = Истина) Экспорт
	
	ЭтоЮридическоеЛицо = 
		Форма.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
	
	ЭтоФизическоеЛицо = 
		Форма.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо");
	
	Элементы = Форма.Элементы;
	
	ВидимостьГруппыПоискаИНННаименование = ЭтоЮридическоеЛицо И Форма.ЗаполнениеРеквизитовПлашкой;
	Элементы.ПолеПоискаИНННаименование.Видимость = ВидимостьГруппыПоискаИНННаименование;
	Элементы.ЗаполнитьРеквизитыПоДаннымЕГР.Видимость = ВидимостьГруппыПоискаИНННаименование;
	
	Элементы.Наименование.Видимость = ЭтоЮридическоеЛицо;
	Элементы.КнопкаЗаполнитьРеквизитыПоНаименованию.Видимость = НЕ Форма.ЗаполнениеРеквизитовПлашкой И ЭтоЮридическоеЛицо;
	
	Если Элементы.Найти("ФИО") <> Неопределено Тогда
		Элементы.ФИО.Видимость = ЭтоФизическоеЛицо;
	КонецЕсли;
	
	Элементы.ИНН.Видимость = ОтображатьРеквизитыФизЛица ИЛИ ЭтоЮридическоеЛицо;
	Элементы.КомандаЗаполнитьПоИНН.Видимость = НЕ Форма.ЗаполнениеРеквизитовПлашкой И ЭтоЮридическоеЛицо;
	
	Элементы.КПП.Видимость       = ЭтоЮридическоеЛицо;
	
	Если Элементы.Найти("ОКТМО") <> Неопределено Тогда
		Элементы.ОКТМО.Видимость     = ОтображатьРеквизитыФизЛица ИЛИ ЭтоЮридическоеЛицо;
	КонецЕсли;
	
	Элементы.НадписьПоясненияНекорректногоИНН.Видимость = (ОтображатьРеквизитыФизЛица ИЛИ ЭтоЮридическоеЛицо) 
		И НЕ ПустаяСтрока(Форма.РезультатПроверкиИНН);
	Элементы.НадписьПоясненияНекорректногоКПП.Видимость = ЭтоЮридическоеЛицо И НЕ ПустаяСтрока(Форма.РезультатПроверкиКПП);
	
КонецПроцедуры

Процедура УстановитьКлючСохраненияПоложенияОкна(Форма, ПрефиксКлючаСохранения) Экспорт
	
	ЭтоЮридическоеЛицо = 
		Форма.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
	ЭтоФизическоеЛицо = 
		Форма.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо");
	
	Если ЭтоЮридическоеЛицо Тогда
		ИмяКлюча = ПрефиксКлючаСохранения + ?(Форма.ЗаполнениеРеквизитовПлашкой,
			"ЮридическоеЛицо", "ЮридическоеЛицоНовый");
	ИначеЕсли ЭтоФизическоеЛицо Тогда
		ИмяКлюча = ПрефиксКлючаСохранения + "ФизическоеЛицо";
	Иначе
		ИмяКлюча = ПрефиксКлючаСохранения;
	КонецЕсли;
	
	Форма.КлючСохраненияПоложенияОкна = ИмяКлюча;
	
КонецПроцедуры

// Возвращает структуру вариантов действия с налогом к возврату.
// 
// Возвращаемое значение:
//   Структура - Описание:
//     * НеВозвращать - Строка - не заполнять заявление на возврат налога.
//     * ВернутьНаСчет - Строка - заполнить заявление на возврат налога на банковский счет.
//
Функция ВариантыДействийСНалогомКВозврату() Экспорт
	
	Варианты = Новый Структура;
	Варианты.Вставить("ВернутьНаСчет", "ВернутьНаСчет");
	Варианты.Вставить("НеВозвращать", "НеВозвращать");
	
	Возврат Варианты;
	
КонецФункции

// Возвращает имя периода, который используется как суффикс для показателей.
//
// Параметры:
// - НомерПериода - Число - Номер периода по порядку 
//
// Возвращаемое значение:
//   Строка - Имя периода
//
Функция ИмяПериодаНарастающимИтогом(НомерПериода) Экспорт
	
	Если НомерПериода = 1 Тогда
		Возврат "1Квартал";
	ИначеЕсли НомерПериода = 2 Тогда
		Возврат "Полугодие";
	ИначеЕсли НомерПериода = 3 Тогда
		Возврат "9Месяцев";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции 

#КонецОбласти
